Revit 2027 API
STLExportOptions Constructor
Overload List
Name | Description
STLExportOptions() |  Constructs a new instance of STLExportOptions with default values of all properties.
STLExportOptions(ExportResolution) |  Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
Top
See Also
Reference
STLExportOptions Class
Autodesk.Revit.DB Namespace